# Pandas
*Pandas* is a fast, powerful, flexible and easy to use open source data analysis and manipulation tool, built on top of the Python programming language.

In [1]:
import pandas as pd

## Series

In [2]:
fruits = pd.Series(["apple", "banana", "pear", "orange", "melon"], index=[5, 6, "sju", 8, 9])
fruits

5       apple
6      banana
sju      pear
8      orange
9       melon
dtype: object

In [23]:
numbers = pd.Series([5, 7, 2])
numbers ** 30

0    8985370930000934825
1    1576789505350337489
2             1073741824
dtype: int64

In [40]:
numbers[numbers >= 5]

0    5
1    7
dtype: int64

In [39]:
fruits[[True, True, False, False, True]]

5     apple
6    banana
9     melon
dtype: object

## DataFrame

In [43]:
data = {
    "name": ["Anders", "Bertil", "Cecilia"],
    "age": [42, 29, 54]
}

df = pd.DataFrame(data)
df

          name  age
fsh     Anders   42
2       Bertil   29
False  Cecilia   54

In [55]:
data = [
    {"name": "Anders","age": 42},
    {"name": "Bertil", "age": 29},
    {"name": "Cecilia", "age": 54}
]

df = pd.DataFrame(data)
df

      name  age
0   Anders   42
1   Bertil   29
2  Cecilia   54

In [48]:
df["name"]

0     Anders
1     Bertil
2    Cecilia
Name: name, dtype: object

In [56]:
df["age"] = df["age"] + 1
df

      name  age
0   Anders   43
1   Bertil   30
2  Cecilia   55

In [57]:
df["age"] >= 50

0    False
1    False
2     True
Name: age, dtype: bool

In [58]:
df[df["age"] >= 50]

      name  age
2  Cecilia   55

In [59]:
str(df)

'      name  age\n0   Anders   43\n1   Bertil   30\n2  Cecilia   55'

In [60]:
print(df)

      name  age
0   Anders   43
1   Bertil   30
2  Cecilia   55